src/toir_cf/src/InformationRegisters/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МобильныеПриложения</name>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.mobileMonitor</types>
      <types>ExchangePlanRef.mobileBrigades</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеПриложение</name>
    <type>
      <types>EnumRef.торо_МобильноеПриложение</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_МобильноеПриложение/торо_МобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_МобильноеПриложение</name>
  <enumValues>
    <name>Регистратор</name>
  </enumValues>
  <enumValues>
    <name>МобильныеБригады</name>
  </enumValues>
  <enumValues>
    <name>МониторСостояния</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Documents/торо_НарядНаРегламентноеМероприятие/торо_НарядНаРегламентноеМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НарядНаРегламентноеМероприятие</name>
  <basedOn>Document.торо_ГрафикРегламентныхМероприятийТОиР</basedOn>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>AccumulationRegister.торо_ЗапланированныеРемонтныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиям</registerRecords>
  <registerRecords>InformationRegister.торо_НарядыПоРемонтам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_ПараллельнойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегламентныеМероприятия</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияОбъектов</name>
    <attributes>
      <name>Мероприятие_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подрядчики</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>EnumRef.торо_ОтветственныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/CommonModules/торо_МобильныеПриложенияУведомления/Module.bsl
#Область ПрограммныйИнтерфейс
// Отправка группы уведомлений о заявке в мобильное приложение.
//
// Параметры:
//  СсылкаНаЗаявку - ДокументСсылка.торо_ЗаявкаНаРемонт - источник оповещения.
//  НоваяЗаявка    - Булево - признак, что заявка еще не была отправлена в мобильное приложение.  
//  Отказ          - Булево - отказ. 
//  СписокБригад   - Список значения - список бригад исполнителей по ремонтам из заявки.
Процедура ОтправитьУведомлениеОЗаявке(СсылкаНаЗаявку, НоваяЗаявка, Отказ, СписокБригад) Экспорт
	
	Если НЕ Отказ И СписокБригад.Количество() > 0 Тогда
		
		Если НоваяЗаявка Тогда
			Заголовок = "Новая заявка";
		Иначе
			Заголовок = "Изменение заявки";
		КонецЕсли;
		Текст = "Заявка " + СсылкаНаЗаявку.Номер;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		                |	торо_МобильныеПриложения.Узел КАК Узел,
		                |	mobileBrigades.ИДПодписчикаУведомлений КАК ИДПодписчикаУведомлений
		                |ИЗ
		                |	РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
		                |		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.mobileBrigades КАК mobileBrigades
		                |		ПО торо_МобильныеПриложения.Узел = mobileBrigades.Ссылка
		                |ГДЕ
		                |	торо_МобильныеПриложения.МобильноеПриложение = ЗНАЧЕНИЕ(Перечисление.торо_МобильноеПриложение.МобильныеБригады)
		                |	И mobileBrigades.ИспользоватьЗаявки
		                |	И mobileBrigades.Бригада В(&СписокБригад)";
		
		Запрос.УстановитьПараметр("СписокБригад", СписокБригад);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИдентификаторПодписчикаУведомлений = Выборка.ИДПодписчикаУведомлений.Получить();
			Если ИдентификаторПодписчикаУведомлений <> Неопределено Тогда
				Данные = Строка(СсылкаНаЗаявку.УникальныйИдентификатор()); 
				Попытка
					ОтправитьPushУведомление(ИдентификаторПодписчикаУведомлений, Заголовок, Текст, Данные);	
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка push уведомления'"), УровеньЖурналаРегистрации.Ошибка,, ОписаниеОшибки);
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Отправка группы уведомлений о наряде в мобильное приложение.
//
// Параметры:
//  СсылкаНаНаряд - ДокументСсылка.торо_НарядНаРегламентноеМероприятие - источник оповещения.
//  НовыйНаряд    - Булево - признак, что наряд еще не был отправлен в мобильное приложение.  
//  Отказ         - Булево - отказ.
Процедура ОтправитьУведомлениеОНаряде(СсылкаНаНаряд, НовыйНаряд, Отказ) Экспорт
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	торо_ГрафикРМПланРемонтов.Исполнитель КАК Исполнитель
		               |ИЗ
		               |	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_РегламентныеМероприятия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРМПланРемонтов
		               |		ПО торо_РегламентныеМероприятия.ДокументИсточник = торо_ГрафикРМПланРемонтов.Ссылка
		               |			И торо_РегламентныеМероприятия.ID = торо_ГрафикРМПланРемонтов.ID
		               |ГДЕ
		               |	торо_РегламентныеМероприятия.Ссылка = &Ссылка
		               |	И торо_ГрафикРМПланРемонтов.Исполнитель ССЫЛКА Справочник.СтруктураПредприятия";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаНаряд);
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		МассивПодразделений = Результат.Выгрузить().ВыгрузитьКолонку("Исполнитель");
		
		Если НовыйНаряд Тогда
			Заголовок = "Новый обход";
		Иначе
			Заголовок = "Изменение обхода";
		КонецЕсли;
		Текст = "Обход " + СсылкаНаНаряд.Номер;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		                |	торо_МобильныеПриложения.Узел КАК Узел,
		                |	mobileBrigades.ИДПодписчикаУведомлений КАК ИДПодписчикаУведомлений
		                |ИЗ
		                |	РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
		                |		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.mobileBrigades КАК mobileBrigades
		                |		ПО торо_МобильныеПриложения.Узел = mobileBrigades.Ссылка
		                |ГДЕ
		                |	торо_МобильныеПриложения.МобильноеПриложение = ЗНАЧЕНИЕ(Перечисление.торо_МобильноеПриложение.МобильныеБригады)
		                |	И mobileBrigades.ИспользоватьРегламентныеМероприятия
		                |	И mobileBrigades.Подразделение В(&МассивПодразделений)";
		
		Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИдентификаторПодписчикаУведомлений = Выборка.ИДПодписчикаУведомлений.Получить();
			Если ИдентификаторПодписчикаУведомлений <> Неопределено Тогда
				Данные = Строка(СсылкаНаНаряд.УникальныйИдентификатор()); 
				Попытка
					ОтправитьPushУведомление(ИдентификаторПодписчикаУведомлений, Заголовок, Текст, Данные);	
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка push уведомления'"), УровеньЖурналаРегистрации.Ошибка,, ОписаниеОшибки);
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Отправление самого push-уведомления.
//
// Параметры:
//  ИдентификаторПодписчикаУведомлений - ХранилищеЗначения - идентификатор получающего данные устройства.
//  Заголовок - Строка - заголовок уведомления.
//  Текст - Строка - текст уведомления.
//  Данные - Строка - ссылка на источник уведомления.
Процедура ОтправитьPushУведомление(ИдентификаторПодписчикаУведомлений, Заголовок, Текст, Данные) Экспорт
	
	Если НЕ ИдентификаторПодписчикаУведомлений.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.APNS Тогда
		
		КлючСервера = "AAAAGMb_R4s:APA91bHJTVUtHpnWckE7H0FvijkzrvJnZyMDwxP0mezJqt7QQDJRQ3KZ3vCog6LajtzaIseWMXGCG6WFWcDQlTU0v-z47qUK_0pcbyBPTVTqdQcuoR2VpGKNNwy5jh243OWvcCgfrxAP";
		
		HTTPСоединение = Новый HTTPСоединение("fcm.googleapis.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		Заголовки = Новый Соответствие(); 
		Заголовки.Вставить("Authorization", "key=" + КлючСервера); 
		Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
		HTTPЗапрос = Новый HTTPЗапрос("/fcm/send", Заголовки);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("data");        
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("data");
		ЗаписьJSON.ЗаписатьЗначение(Данные);    
		ЗаписьJSON.ЗаписатьИмяСвойства("base");
		ЗаписьJSON.ЗаписатьЗначение(ИдентификаторПодписчикаУведомлений.ИдентификаторИнформационнойБазы);
		ЗаписьJSON.ЗаписатьИмяСвойства("title");
		ЗаписьJSON.ЗаписатьЗначение(Заголовок);
		ЗаписьJSON.ЗаписатьИмяСвойства("text");
		ЗаписьJSON.ЗаписатьЗначение(Текст);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("collapse_key");
		ЗаписьJSON.ЗаписатьЗначение("desnol-toir30-mb");
		ЗаписьJSON.ЗаписатьИмяСвойства("to");
		ЗаписьJSON.ЗаписатьЗначение(ИдентификаторПодписчикаУведомлений.ИдентификаторУстройства);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		СтрокаЗапроса = ЗаписьJSON.Закрыть();
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, КодировкаТекста.UTF8);
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
		Результат = HTTPОтвет.ПолучитьТелоКакСтроку();
		
	Иначе
		
		НаклейкаУведомления = 0;
		Сертификат = ПолучитьОбщийМакет("торо_APNsСертификат");
		
		ДанныеАвторизации = Новый Соответствие;
		ДанныеАвторизации.Вставить(ТипПодписчикаДоставляемыхУведомлений.APNS, Сертификат);
		
		Уведомление = Новый ДоставляемоеУведомление;
		Уведомление.Получатели.Добавить(ИдентификаторПодписчикаУведомлений);
		Уведомление.Заголовок = Заголовок;
		Уведомление.Текст = Текст;
		Уведомление.Данные = Данные;
		Уведомление.Наклейка = НаклейкаУведомления;
		Уведомление.ЗвуковоеОповещение = ЗвуковоеОповещение.ПоУмолчанию;
		
		ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, ДанныеАвторизации);
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
